frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103xB.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RTC</name>
            <description>Real time clock</description>
            <groupName>RTC</groupName>
            <baseAddress>0x40002800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC</name>
                <description>RTC global interrupt</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>RTCAlarm</name>
                <description>RTC Alarms through EXTI line interrupt</description>
                <value>41</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SECIEN</name>
                            <description>Second interrupt Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRIEN</name>
                            <description>Alarm interrupt Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVRIEN</name>
                            <description>Overflow interrupt Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>Control and State register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000020</resetValue>
                    <fields>
                        <field>
                            <name>SECFLG</name>
                            <description>Second Flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALRFLG</name>
                            <description>Alarm Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVRFLG</name>
                            <description>Overflow Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSYNCFLG</name>
                            <description>Registers Synchronized Flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFGMFLG</name>
                            <description>Configuration Flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFLG</name>
                            <description>RTC operation OFF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSCRLDH</name>
                    <displayName>PSCRLDH</displayName>
                    <description>RTC predivision loading register High Bit</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PSCRLDH</name>
                            <description>RTC Prescaler Load Register High</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSCRLDL</name>
                    <displayName>PSCRLDL</displayName>
                    <description>RTC predivision loading register Low Bit</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x8000</resetValue>
                    <fields>
                        <field>
                            <name>PSCRLDL</name>
                            <description>RTC Prescaler Divider Register Low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSCH</name>
                    <displayName>PSCH</displayName>
                    <description>RTC predivider remainder register High Bit</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PSCH</name>
                            <description>RTC prescaler divider register high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSCL</name>
                    <displayName>PSCL</displayName>
                    <description>RTC predivider remainder register Low Bit</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x8000</resetValue>
                    <fields>
                        <field>
                            <name>PSCL</name>
                            <description>RTC prescaler divider register Low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNTH</name>
                    <displayName>CNTH</displayName>
                    <description>RTC count register High Bit</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTH</name>
                            <description>RTC counter register high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNTL</name>
                    <displayName>CNTL</displayName>
                    <description>RTC count register Low Bit</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTL</name>
                            <description>RTC counter register Low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRH</name>
                    <displayName>ALRH</displayName>
                    <description>RTC alarm clock register High Bit</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0xFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ALRH</name>
                            <description>RTC alarm register high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRL</name>
                    <displayName>ALRL</displayName>
                    <description>RTC alarm clock register Low Bit</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0xFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ALRL</name>
                            <description>RTC alarm register low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
